tutorials/multicomponentFluid/simplifiedSiwek/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Create mesh
runApplication blockMesh

# Create ignition cells cellSet
runApplication topoSet

runApplication foamRun

#------------------------------------------------------------------------------
